// export const url = `http://${window.location.hostname}:8080`;
export const url = `http://studentsystem.xyz:8080`;  //Чтобы тестировать раскомментируй это, но когда коммитишь верни обратно либо убери с файла галочку чтобы не коммитнулось

export let timetable = {
    "ИС-20-Д": {
        "Понедельник": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Вторник": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Среда": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Четверг": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ]
        ],
        "Пятница": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Суббота": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ]
    },
    "ИС-21-Д": {
        "Дата начала недели": "24.10.2022",
        "Понедельник": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Вторник": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Среда": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Четверг": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ]
        ],
        "Пятница": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "10:30",
                "12:05",
                "Китайский язык",
                "пр",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Суббота": [
            [
                "8:40",
                "10:15",
                "Теория вероятностей. Математическая статистика.",
                "лекц",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "12:20",
                "13:55",
                "Математическое моделирование",
                "лаб",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ]
    }
}

export const weatherCodes = {
    "0": "Unknown",
    "113": "Sunny",
    "116": "PartlyCloudy",
    "119": "Cloudy",
    "122": "VeryCloudy",
    "143": "Fog",
    "176": "LightShowers",
    "179": "LightSleetShowers",
    "182": "LightSleet",
    "185": "LightSleet",
    "200": "ThunderyShowers",
    "227": "LightSnow",
    "230": "HeavySnow",
    "248": "Fog",
    "260": "Fog",
    "263": "LightShowers",
    "266": "LightRain",
    "281": "LightSleet",
    "284": "LightSleet",
    "293": "LightRain",
    "296": "LightRain",
    "299": "HeavyShowers",
    "302": "HeavyRain",
    "305": "HeavyShowers",
    "308": "HeavyRain",
    "311": "LightSleet",
    "314": "LightSleet",
    "317": "LightSleet",
    "320": "LightSnow",
    "323": "LightSnowShowers",
    "326": "LightSnowShowers",
    "329": "HeavySnow",
    "332": "HeavySnow",
    "335": "HeavySnowShowers",
    "338": "HeavySnow",
    "350": "LightSleet",
    "353": "LightShowers",
    "356": "HeavyShowers",
    "359": "HeavyRain",
    "362": "LightSleetShowers",
    "365": "LightSleetShowers",
    "368": "LightSnowShowers",
    "371": "HeavySnowShowers",
    "374": "LightSleetShowers",
    "377": "LightSleet",
    "386": "ThunderyShowers",
    "389": "ThunderyHeavyRain",
    "392": "ThunderySnowShowers",
    "395": "HeavySnowShowers",
}

export const weatherSymbols = {
    "Unknown": "✨",
    "Cloudy": "☁️",
    "Fog": "🌫",
    "HeavyRain": "🌧",
    "HeavyShowers": "🌧",
    "HeavySnow": "❄️",
    "HeavySnowShowers": "❄️",
    "LightRain": "🌦",
    "LightShowers": "🌦",
    "LightSleet": "🌧",
    "LightSleetShowers": "🌧",
    "LightSnow": "🌨",
    "LightSnowShowers": "🌨",
    "PartlyCloudy": "⛅️",
    "Sunny": "☀️",
    "ThunderyHeavyRain": "🌩",
    "ThunderyShowers": "⛈",
    "ThunderySnowShowers": "⛈",
    "VeryCloudy": "☁️",
}

export function getCookie(name) {
    const value = `; ${document.cookie}`;
    const parts = value.split(`; ${name}=`);
    if (parts.length === 2) return parts.pop().split(";").shift();
}

export function logout() {
    localStorage.removeItem('userData')
    document.cookie = "TOKEN=null;max-age=0";
    document.cookie = "ID=null;max-age=0";
    window.location.href = '/'
}